#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_ecr_repository.flood_warning_check: Refreshing state... [id=c18-climate-monitor-flood-warning-check-ecr]
aws_ecr_repository.current_air_quality: Refreshing state... [id=c18-climate-monitor-current-air-quality-ecr]
aws_iam_role.lambda: Refreshing state... [id=c18-climate-monitor-lambda-iam]
aws_ecr_repository.future_predictions: Refreshing state... [id=c18-climate-monitor-future-predictions-ecr]
aws_cloudwatch_log_group.future_climate: Refreshing state... [id=/aws/lambda/c18-climate-monitor-future-predictions-lambda]
aws_ecr_repository.historic_weather: Refreshing state... [id=c18-climate-monitor-historic-weather-ecr]
aws_cloudwatch_log_group.location_assignment: Refreshing state... [id=/aws/lambda/c18-climate-monitor-location-assignment-lambda]
aws_cloudwatch_log_group.historic_weather: Refreshing state... [id=/aws/lambda/c18-climate-monitor-historic-weather-lambda]
aws_ecr_repository.location_assignment: Refreshing state... [id=c18-climate-monitor-location-assignment-ecr]
aws_cloudwatch_log_group.new_location_orchestrator: Refreshing state... [id=/aws/lambda/c18-climate-monitor-new-location-orchestrator-lambda]
aws_cloudwatch_log_group.current_air_quality: Refreshing state... [id=/aws/lambda/c18-climate-monitor-current-air-quality-lambda]
aws_security_group.allow_5432: Refreshing state... [id=sg-00146638977b9f8dc]
aws_ecr_repository.new_location_orchestrator: Refreshing state... [id=c18-climate-monitor-new-location-orchestrator-ecr]
aws_iam_role.orchestrator_lambda: Refreshing state... [id=c18-climate-monitor-orchestrator-lambda-iam]
aws_ecr_repository.dashboard: Refreshing state... [id=c18-climate-monitor-dashboard-ecr]
aws_cloudwatch_log_group.current_reading_orchestrator: Refreshing state... [id=/aws/lambda/c18-climate-monitor-current-reading-orchestrator-lambda]
data.aws_iam_policy_document.example: Reading...
data.aws_iam_policy_document.example: Read complete after 0s [id=1734155287]
aws_cloudwatch_log_group.current_weather: Refreshing state... [id=/aws/lambda/c18-climate-monitor-current-weather-lambda]
aws_ecr_repository.daily_summary: Refreshing state... [id=c18-climate-monitor-daily-summary-ecr]
aws_ecr_repository.current_reading_orchestrator: Refreshing state... [id=c18-climate-monitor-current-reading-orchestrator-ecr]
aws_iam_role.lambda_scheduler: Refreshing state... [id=c18-climate-monitor-scheduler-iam]
aws_ecr_repository.historic_air_quality: Refreshing state... [id=c18-climate-monitor-historic-air-quality-ecr]
data.aws_ecs_cluster.existing: Reading...
aws_cloudwatch_log_group.historic_air_quality: Refreshing state... [id=/aws/lambda/c18-climate-monitor-historic-air-quality-lambda]
aws_cloudwatch_log_group.live_flood_warnings: Refreshing state... [id=/aws/lambda/c18-climate-monitor-live-flood-warnings-lambda]
aws_ecr_repository.current_weather: Refreshing state... [id=c18-climate-monitor-current-weather-ecr]
aws_iam_role_policy_attachment.lambda_basic_exec_role: Refreshing state... [id=c18-climate-monitor-lambda-iam/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
aws_iam_role_policy_attachment.orchestrator_lambda_basic_exec_role: Refreshing state... [id=c18-climate-monitor-orchestrator-lambda-iam/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
aws_iam_role_policy.invoke_lambdas: Refreshing state... [id=c18-climate-monitor-orchestrator-lambda-iam:invoke-other-lambdas]
aws_iam_role_policy.pipeline_scheduler: Refreshing state... [id=c18-climate-monitor-scheduler-iam:c18-climate-monitor-scheduler-policy]
aws_ecr_repository_policy.example: Refreshing state... [id=c18-climate-monitor-historic-air-quality-ecr]
aws_lambda_function.new_location_orchestrator: Refreshing state... [id=c18-climate-monitor-new-location-orchestrator-lambda]
aws_vpc_security_group_ingress_rule.allow_ingress_5432: Refreshing state... [id=sgr-0c0647e7620fc928e]
aws_db_instance.climate: Refreshing state... [id=db-FRWD4BKFF4THTAGHZDARGIT56U]
data.aws_ecs_cluster.existing: Read complete after 0s [id=arn:aws:ecs:eu-west-2:129033205317:cluster/c18-ecs-cluster]
aws_lambda_function.location_assignment: Refreshing state... [id=c18-climate-monitor-location-assignment-lambda]
aws_lambda_function.current_weather: Refreshing state... [id=c18-climate-monitor-current-weather-lambda]
aws_lambda_function.historic_air_quality: Refreshing state... [id=c18-climate-monitor-historic-air-quality-lambda]
aws_lambda_function.live_flood_warnings: Refreshing state... [id=c18-climate-monitor-live-flood-warnings-lambda]
aws_lambda_function.current_air_quality: Refreshing state... [id=c18-climate-monitor-current-air-quality-lambda]
aws_lambda_function.future_climate: Refreshing state... [id=c18-climate-monitor-future-predictions-lambda]
aws_lambda_function.current_reading_orchestrator: Refreshing state... [id=c18-climate-monitor-current-reading-orchestrator-lambda]
aws_lambda_function.historic_weather: Refreshing state... [id=c18-climate-monitor-historic-weather-lambda]
aws_scheduler_schedule.live_flood_warnings_scheduler: Refreshing state... [id=default/c18-climate-monitor-live-flood-warnings-scheduler]
aws_scheduler_schedule.current_reading_orchestrator_scheduler: Refreshing state... [id=default/c18-climate-monitor-current_reading_orchestrator-scheduler]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.streamlit_logs will be created
  + resource "aws_cloudwatch_log_group" "streamlit_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/c18-climate-monitor-dashboard"
      + name_prefix       = (known after apply)
      + region            = "eu-west-2"
      + retention_in_days = 7
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_ecs_service.streamlit_service will be created
  + resource "aws_ecs_service" "streamlit_service" {
      + arn                                = (known after apply)
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "arn:aws:ecs:eu-west-2:129033205317:cluster/c18-ecs-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "c18-climate-monitor-dashboard-service"
      + platform_version                   = (known after apply)
      + region                             = "eu-west-2"
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-0679d4b1f9e7839ef",
              + "subnet-0aed07ac008a10da9",
              + "subnet-0f10662561eade8c3",
            ]
        }
    }

  # aws_ecs_task_definition.streamlit_dashboard will be created
  + resource "aws_ecs_task_definition" "streamlit_dashboard" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "streamlit-dashboard-task"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + region                   = "eu-west-2"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # aws_iam_role.ecs_task_execution_role will be created
  + resource "aws_iam_role" "ecs_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "c18-climate-monitor-ecsTaskExecutionRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_execution_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecs_execution_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "c18-climate-monitor-ecsTaskExecutionRole"
    }

  # aws_security_group.streamlit_sg will be created
  + resource "aws_security_group" "streamlit_sg" {
      + arn                    = (known after apply)
      + description            = "Allow inbound traffic to Streamlit dashboard"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow traffic on port 8501"
              + from_port        = 8501
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8501
            },
        ]
      + name                   = "c18-climate-monitor-streamlit-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "eu-west-2"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "climate-monitor-dashboard-sg"
        }
      + tags_all               = {
          + "Name" = "climate-monitor-dashboard-sg"
        }
      + vpc_id                 = "vpc-0adcb6a62ca552c01"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @AmiruthaVallii, Action: `pull_request`*